"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
const Data_Dungeon = {
    슬라임: {
        channelID: '1025355108382421022',
        체력: 1,
        공격력: 0,
        획득경험치: 1,
        획득R: 1,
        드롭아이템: {},
    },
    풀슬라임: {
        channelID: '1026111522067460106',
        체력: 3,
        공격력: 2,
        획득경험치: 2,
        획득R: 2,
        드롭아이템: {},
    },
    잎슬라임: {
        channelID: '1026111522067460106',
        체력: 5,
        공격력: 4,
        획득경험치: 3,
        획득R: 3,
        드롭아이템: {},
    },
    나무슬라임: {
        channelID: '1026119448156966992',
        체력: 5,
        공격력: 5,
        획득경험치: 4,
        획득R: 4,
        드롭아이템: {
            '쓸만한 나무 막대기': 0.6,
        },
    },
    숲슬라임: {
        channelID: '1026119448156966992',
        체력: 8,
        공격력: 7,
        획득경험치: 6,
        획득R: 6,
        드롭아이템: {
            '쓸만한 나무 막대기': 0.3,
            '작은 숲 방어구': 0.3,
            '???': 0.1,
        },
    },
    작은호수슬라임: {
        channelID: '1026121469907968051',
        체력: 8,
        공격력: 7,
        획득경험치: 7,
        획득R: 7,
        드롭아이템: {
            '작은 호수의 검': 0.5,
            '리시페의 검 {레어}': 2,
            '작은 호수의 갑옷': 0.5,
            '리시페의 갑옷 {레어}': 2,
        },
    },
    작은강가슬라임: {
        channelID: '1026161001407725588',
        체력: 5,
        공격력: 6,
        획득경험치: 5,
        획득R: 5,
        드롭아이템: {},
    },
    작은강가정령: {
        channelID: '1026161001407725588',
        체력: 7,
        공격력: 8,
        획득경험치: 7,
        획득R: 7,
        드롭아이템: {
            '작은 강가 마법봉': 0.3,
        },
    },
    강슬라임: {
        channelID: '1032216362103353384',
        체력: 9,
        공격력: 8,
        획득경험치: 8,
        획득R: 8,
        드롭아이템: {},
    },
    퍼실슬라임: {
        channelID: '1032216362103353384',
        체력: 11,
        공격력: 10,
        획득경험치: 10,
        획득R: 10,
        드롭아이템: {
            '아쿠아 슬라임 헬멧': 0.2,
            '퍼실 헬멧 {레어}': 0.3,
            '퍼실 디펜더 {유일}': 0.003,
        },
    },
    퍼실의정령: {
        channelID: '1032216362103353384',
        체력: 14,
        공격력: 13,
        획득경험치: 11,
        획득R: 11,
        드롭아이템: {
            '작은 강 지팡이': 0.2,
            '퍼실 지팡이 {레어}': 0.3,
            '매직 퍼실즈 {유일}': 0.003,
        },
    },
    작은언덕의슬라임: {
        channelID: '1035476140753703012',
        체력: 10,
        공격력: 9,
        획득경험치: 9,
        획득R: 9,
        드롭아이템: {},
    },
    작은언덕정령: {
        channelID: '1035476140753703012',
        체력: 15,
        공격력: 14,
        획득경험치: 12,
        획득R: 12,
        드롭아이템: {
            '작은 언덕 지팡이': 0.2,
        },
    },
    스톤슬라임: {
        channelID: '1035476140753703012',
        체력: 17,
        공격력: 16,
        획득경험치: 13,
        획득R: 13,
        드롭아이템: {
            '스톤 슬라임 헬멧': 0.3,
        },
    },
    // 계절
    겨울슬라임: {
        channelID: '1026124882746032249',
        체력: 12,
        공격력: 12,
        획득경험치: 10,
        획득R: 10,
        드롭아이템: {
            '22 겨울의 검': 0.4,
            '22 겨울 갑옷': 0.8,
        },
    },
};
exports.default = Data_Dungeon;
//# sourceMappingURL=Dungeon.js.map