import { Snowflake } from 'discord.js'

type DropItem = { [이름: string]: number } // 이름: 획득확률

type DungeonData = {
  [key: string]: {
    channelID: Snowflake
    체력: number
    공격력: number
    획득경험치: number
    획득R: number
    드롭아이템: DropItem
  }
}

const Data_Dungeon: DungeonData = {
  슬라임: {
    channelID: '1025355108382421022',
    체력: 1,
    공격력: 0,
    획득경험치: 1,
    획득R: 1,
    드롭아이템: {},
  },
  풀슬라임: {
    channelID: '1026111522067460106',
    체력: 3,
    공격력: 2,
    획득경험치: 2,
    획득R: 2,
    드롭아이템: {},
  },
  잎슬라임: {
    channelID: '1026111522067460106',
    체력: 5,
    공격력: 4,
    획득경험치: 3,
    획득R: 3,
    드롭아이템: {},
  },
  나무슬라임: {
    channelID: '1026119448156966992',
    체력: 5,
    공격력: 5,
    획득경험치: 4,
    획득R: 4,
    드롭아이템: {
      '쓸만한 나무 막대기': 0.6,
    },
  },
  숲슬라임: {
    channelID: '1026119448156966992',
    체력: 8,
    공격력: 4,
    획득경험치: 6,
    획득R: 6,
    드롭아이템: {
      '쓸만한 나무 막대기': 0.3,
      '작은 숲 방어구': 0.3,
      '???': 0.1,
    },
  },
  작은강가슬라임: {
    channelID: '1026161001407725588',
    체력: 5,
    공격력: 6,
    획득경험치: 5,
    획득R: 5,
    드롭아이템: {},
  },
  작은강가정령: {
    channelID: '1026161001407725588',
    체력: 7,
    공격력: 8,
    획득경험치: 7,
    획득R: 7,
    드롭아이템: {
      '작은 강가 마법봉': 0.3,
    },
  },
}

export default Data_Dungeon
